In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('data.csv')
df.head(5)

  Category  value
0        A     10
1        B     20
2        A     30
3        B     40
4        C     50

In [4]:
df.describe()

           value
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

In [7]:
df.dtypes

Category    object
value        int64
dtype: object

In [9]:
## handling missing values

df.isnull().any(axis=1)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [10]:
df.isnull().sum()

Category    0
value       0
dtype: int64

In [12]:
df.fillna(0)

  Category  value
0        A     10
1        B     20
2        A     30
3        B     40
4        C     50

In [ ]:
## filling missing values with the mean of the columns
df['sales_fillNA']=df['sales'].fillna(df['sales'].mean())
df

In [16]:
## renaming columns
df=df.rename(columns={'Date':'sales_Data'})
df.head()

  Category  value
0        A     10
1        B     20
2        A     30
3        B     40
4        C     50

In [17]:
## change datatype

df['value_new']=df['value'].astype(float)
df.head()

  Category  value  value_new
0        A     10       10.0
1        B     20       20.0
2        A     30       30.0
3        B     40       40.0
4        C     50       50.0

In [18]:
df['new value']=df['value'].apply(lambda x:x*2)
df.head()

  Category  value  value_new  new value
0        A     10       10.0         20
1        B     20       20.0         40
2        A     30       30.0         60
3        B     40       40.0         80
4        C     50       50.0        100

In [19]:
## data aggregating and grouping

df.head()

  Category  value  value_new  new value
0        A     10       10.0         20
1        B     20       20.0         40
2        A     30       30.0         60
3        B     40       40.0         80
4        C     50       50.0        100

In [ ]:
grouped_mean=df.groupby('product')['value'].mean()
print(grouped_mean)

In [ ]:
grouped_sum=df.groupby('product','region')['value'].sum()
print(grouped_sum)

In [ ]:
## aggregating multiple functions
grouped_age=df.groupby('region')['value'].agg(['mean','sum','count'])
grouped_age

In [8]:
## merging and joining dataframes

import pandas as pd

df1=pd.DataFrame({'key':['A','B','C'],'value1':[1,2,3]})
df2=pd.DataFrame({'key':['A','B','D'],'value2':[4,5,6]})

In [4]:
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [9]:
df2

  key  value2
0   A       4
1   B       5
2   D       6

In [10]:
## merge dataframes on the 'key columns'
pd.merge(df1,df2,on="key",how="inner")

  key  value1  value2
0   A       1       4
1   B       2       5

In [11]:
pd.merge(df1,df2,on="key",how="outer")

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [12]:
pd.merge(df1,df2,on="key",how="left")

  key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN